000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АналитикаХозяйственныхОпераций/АналитикаХозяйственныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитикаХозяйственныхОпераций</name>
  <predefined>
    <items>
      <name>ВозвратОтПокупателя</name>
      <description>Возврат от покупателя</description>
    </items>
    <items>
      <name>ВозвратПоставщику</name>
      <description>Возврат поставщику</description>
    </items>
    <items>
      <name>КомплектацияНоменклатуры</name>
      <description>Комплектация номенклатуры</description>
    </items>
    <items>
      <name>ОприходованиеПоИнвентаризации</name>
      <description>Оприходование по инвентаризации</description>
    </items>
    <items>
      <name>ОприходованиеПоИнвентаризацииСамостоятельной</name>
      <description>Оприходование по инвентаризации самостоятельной</description>
    </items>
    <items>
      <name>ОприходованиеТоваров</name>
      <description>Оприходование товаров</description>
    </items>
    <items>
      <name>ПередачаПодарочныхСертификатовВПодарок</name>
      <description>Передача подарочных сертификатов в подарок</description>
    </items>
    <items>
      <name>ПередачаТоваровДоРеализации</name>
      <description>Передача товаров до реализации</description>
    </items>
    <items>
      <name>ПередачаТоваровПослеРеализации</name>
      <description>Передача товаров после реализации</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ПересортицаТоваров</name>
      <description>Пересортица товаров</description>
    </items>
    <items>
      <name>ПогашениеПодарочныхСертификатов</name>
      <description>Погашение подарочных сертификатов</description>
    </items>
    <items>
      <name>ПоступлениеТоваров</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемТоваровОтДругойОрганизации</name>
      <description>Прием товаров от другой организации</description>
    </items>
    <items>
      <name>ПродажаПодаркаПодарочныйСертификат</name>
      <description>Продажа подарка «Подарочный сертификат»</description>
    </items>
    <items>
      <name>РеализацияТоваров</name>
      <description>Реализация товаров</description>
    </items>
    <items>
      <name>СборкаТоваровПодЗаказПокупателя</name>
      <description>Сборка товаров под заказ покупателя</description>
    </items>
    <items>
      <name>СписаниеНаЗатраты</name>
      <description>Списание на затраты</description>
    </items>
    <items>
      <name>СкидкиПодарки</name>
      <description>Списание на затраты (подарки)</description>
    </items>
    <items>
      <name>СписаниеПоИнвентаризации</name>
      <description>Списание по инвентаризации</description>
    </items>
    <items>
      <name>СписаниеПоИнвентаризацииСамостоятельной</name>
      <description>Списание по инвентаризации самостоятельной</description>
    </items>
  </predefined>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыПоВедомостям</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыРаботнику</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОплатаФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровДоРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровПослеРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПриемТоваровОтДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваров</name>
  </enumValues>
  <enumValues>
    <name>СдачаДенежныхСредствВБанк</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасхожденийДенежныхСредств</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ВозвратТоваровОтПокупателя/ВозвратТоваровОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратТоваровОтПокупателя</name>
  <basedOn>Document.РеализацияТоваров</basedOn>
  <registerRecords>AccumulationRegister.ПродажиПоДисконтнымКартам</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыПогашение</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллы</registerRecords>
  <registerRecords>InformationRegister.ДвиженияСерийныхНомеров</registerRecords>
  <registerRecords>InformationRegister.СостоянияСерийныхНомеров</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыВРезерве</registerRecords>
  <registerRecords>InformationRegister.СписанныеБонусныеБаллы</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыПоЗаказамПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаМагазинах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <attributes>
    <name>АвторасчетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДисконтнойКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачислениеБонусныхБаллов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрограммаЛояльности</name>
      <type>
        <types>CatalogRef.ПрограммыЛояльности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <comment>Номера подарочных сертификатов</comment>
    <attributes>
      <name>СерийныйНомер</name>
      <comment>Номер подарочного сертификата</comment>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСерийныхНомеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДокументПродажи</name>
      <type>
        <types>DocumentRef.РеализацияТоваров</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСерийныхНомеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловСписано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧекККМ</name>
      <type>
        <types>DocumentRef.ЧекККМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АналитикаХозяйственныхОпераций/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Для предопределенных элементов получает правильный код операции
//
// Параметры:
//  ИмяПредопределенногоЭлемента - строка имя предопределенного элемента
//
// Возвращаемое значение:
//  Перечисление.ХозяйственныеОперации 
//
Функция ПолучитьПравильнуюХозяйственнуюОперацию(ИмяПредопределенногоЭлемента = "") Экспорт

	Если Ссылка = Справочники.АналитикаХозяйственныхОпераций.ВозвратОтПокупателя Тогда
		
		ИмяПредопределенногоЭлемента = "Возврат от покупателя";
		Возврат Перечисления.ХозяйственныеОперации.ВозвратОтПокупателя;

	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ВозвратПоставщику Тогда
		
		ИмяПредопределенногоЭлемента = "Возврат поставщику";
		Возврат Перечисления.ХозяйственныеОперации.ВозвратПоставщику;

	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.КомплектацияНоменклатуры Тогда
		
		ИмяПредопределенногоЭлемента = "Комплектация номенклатуры";
		Возврат Перечисления.ХозяйственныеОперации.КомплектацияНоменклатуры;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ОприходованиеТоваров Тогда
		
		ИмяПредопределенногоЭлемента = "Оприходование товаров";
		Возврат Перечисления.ХозяйственныеОперации.Оприходование;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПередачаТоваровДоРеализации Тогда
		
		ИмяПредопределенногоЭлемента = "Передача товаров до реализации";
		Возврат Перечисления.ХозяйственныеОперации.ПередачаТоваровДоРеализации;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПередачаТоваровПослеРеализации Тогда
		
		ИмяПредопределенногоЭлемента = "Передача товаров после реализации";
		Возврат Перечисления.ХозяйственныеОперации.ПередачаТоваровПослеРеализации;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПеремещениеТоваров Тогда
		
		ИмяПредопределенногоЭлемента = "Перемещение товаров";
		Возврат Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПересортицаТоваров Тогда
		
		ИмяПредопределенногоЭлемента = "Пересортица товаров";
		Возврат Перечисления.ХозяйственныеОперации.ПересортицаТоваров;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов Тогда
		
		ИмяПредопределенногоЭлемента = "Погашение подарочных сертификатов";
		Возврат Перечисления.ХозяйственныеОперации.ПогашениеПодарочныхСертификатов;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПоступлениеТоваров Тогда
		
		ИмяПредопределенногоЭлемента = "Поступление товаров";
		Возврат Перечисления.ХозяйственныеОперации.ПоступлениеТоваров;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПриемТоваровОтДругойОрганизации Тогда
		
		ИмяПредопределенногоЭлемента = "Прием товаров от другой организации";
		Возврат Перечисления.ХозяйственныеОперации.ПриемТоваровОтДругойОрганизации;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.РеализацияТоваров Тогда
		
		ИмяПредопределенногоЭлемента = "Реализация товаров";
		Возврат Перечисления.ХозяйственныеОперации.РеализацияТоваров;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПередачаПодарочныхСертификатовВПодарок Тогда	//	LNK 15.05.2021 06:40:14
		
		ИмяПредопределенногоЭлемента = "Передача подарочных сертификатов в подарок";
		Возврат Перечисления.ХозяйственныеОперации.РеализацияТоваров;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ПродажаПодаркаПодарочныйСертификат Тогда	//	LNK 17.05.2021 06:50:33
		
		ИмяПредопределенногоЭлемента = "Продажа подарка «Подарочный сертификат»";
		Возврат Перечисления.ХозяйственныеОперации.РеализацияТоваров;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.СкидкиПодарки Тогда
		
		ИмяПредопределенногоЭлемента = "Списание на затраты (подарки)";
		Возврат Перечисления.ХозяйственныеОперации.СписаниеНаЗатраты;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ОприходованиеПоИнвентаризации Тогда
		
		ИмяПредопределенногоЭлемента = "Оприходование по инвентаризации";
		Возврат Перечисления.ХозяйственныеОперации.ОприходованиеПоИнвентаризации;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.СписаниеПоИнвентаризации Тогда
		
		ИмяПредопределенногоЭлемента = "Списание по инвентаризации";
		Возврат Перечисления.ХозяйственныеОперации.СписаниеПоИнвентаризации;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.СписаниеНаЗатраты Тогда
		
		ИмяПредопределенногоЭлемента = "Списание на прочие затраты";
		Возврат Перечисления.ХозяйственныеОперации.СписаниеНаЗатраты;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.ОприходованиеПоИнвентаризацииСамостоятельной Тогда
		
		ИмяПредопределенногоЭлемента = "Оприходование по инвентаризации самостоятельной";
		Возврат Перечисления.ХозяйственныеОперации.ОприходованиеПоИнвентаризации;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.СписаниеПоИнвентаризацииСамостоятельной Тогда
		
		ИмяПредопределенногоЭлемента = "Списание по инвентаризации самостоятельной";
		Возврат Перечисления.ХозяйственныеОперации.СписаниеПоИнвентаризации;
		
	ИначеЕсли Ссылка = Справочники.АналитикаХозяйственныхОпераций.СборкаТоваровПодЗаказПокупателя Тогда
		
		ИмяПредопределенногоЭлемента = "Сборка товаров под заказ покупателя";
		Возврат Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		
	Иначе
		
		Возврат Перечисления.ХозяйственныеОперации.ПустаяСсылка();
		
	КонецЕсли;

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
    		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоНовый() Тогда 
		
		Если Предопределенный Тогда
			
			ИмяПредопределенногоЭлемента = "";
			ПравильнаяХозяйственнаяОперация = ПолучитьПравильнуюХозяйственнуюОперацию(ИмяПредопределенногоЭлемента);
			
			Если НЕ ПравильнаяХозяйственнаяОперация = ХозяйственнаяОперация Тогда
				
				ТекстОшибки = НСтр("ru = 'Для этого предопределенного элемента 
				|возможно задать только код хозяйственной
				| "+ИмяПредопределенногоЭлемента+"'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					"ХозяйственнаяОперация",
					,
					Отказ);
							
			КонецЕсли;			
			
		ИначеЕсли ЗначениеЗаполнено(Ссылка.ХозяйственнаяОперация) 
			И Не Ссылка.ХозяйственнаяОперация = ХозяйственнаяОперация Тогда
			
			Если НЕ ПроверитьХозяйственнуюОперацию() Тогда
							
				ТекстОшибки = НСтр("ru = 'Нельзя изменить код хозяйственной операции,
				|так как он используется в документах'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					"ХозяйственнаяОперация",
					,
					Отказ);
						
			КонецЕсли;
						
		КонецЕсли;	
				
	КонецЕсли;	
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет правильность заполнения кода хозяйственной операции
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Булево - "Истина", если ошибка есть 
//
Функция ПроверитьХозяйственнуюОперацию()

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТоваровОтПокупателя.АналитикаХозяйственнойОперации
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|ГДЕ
	|	ВозвратТоваровОтПокупателя.АналитикаХозяйственнойОперации = &АналитикаХозяйственнойОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщику.АналитикаХозяйственнойОперации
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|ГДЕ
	|	ВозвратТоваровПоставщику.АналитикаХозяйственнойОперации = &АналитикаХозяйственнойОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахВозвращенныеТовары.АналитикаХозяйственнойОперации
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ВозвращенныеТовары КАК ОтчетОРозничныхПродажахВозвращенныеТовары
	|ГДЕ
	|	ОтчетОРозничныхПродажахВозвращенныеТовары.АналитикаХозяйственнойОперации = &АналитикаХозяйственнойОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМ.АналитикаХозяйственнойОперации
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.АналитикаХозяйственнойОперации = &АналитикаХозяйственнойОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеТоваров.АналитикаХозяйственнойОперации
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.АналитикаХозяйственнойОперации = &АналитикаХозяйственнойОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеТоваров.АналитикаХозяйственнойОперации
	|ИЗ
	|	Документ.СписаниеТоваров КАК СписаниеТоваров
	|ГДЕ
	|	СписаниеТоваров.АналитикаХозяйственнойОперации = &АналитикаХозяйственнойОперации");
	
	Запрос.УстановитьПараметр("АналитикаХозяйственнойОперации", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	

КонецФункции
